In [7]:
import pandas as pd

df = pd.read_csv("PivotingData.csv")
df

       date       city  temperature  humidity
0  1/5/2022  Bangalore         34.5        34
1  1/6/2022     Mysore         36.0        32
2  1/5/2022  Mangalore         37.2        33
3  1/5/2022     Mysore         35.0        45
4  1/6/2022  Mangalore         26.0        25
5  1/6/2022  Bangalore         13.0        38

In [8]:
pdf=df.pivot(index="city",columns="date",values="humidity")
pdf

date       1/5/2022  1/6/2022
city
Bangalore        34        38
Mangalore        33        25
Mysore           45        32